tutorials/fluidSolidInteraction/hessenthalerFsi/constant/fluid/g
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.4                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       uniformDimensionedVectorField;
    location    "constant";
    object      g;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// The fluid is solved without gravity: the hydrostatic pressure rho_f*g.x is
// absorbed into the (kinematic) pressure, as in the change of variables of
// Hessenthaler, Roehrle and Nordsletten (2017), and the resulting buoyancy of
// the flap is applied to the solid instead (see constant/solid/g)
dimensions      [0 1 -2 0 0 0 0];
value           (0 0 0);

// ************************************************************************* //
