tutorials/fluidSolidInteraction/hessenthalerFsi/constant/fsiProperties
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.4                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fsiProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

fluidSolidInterface    IQNILS;

IQNILSCoeffs
{
    // Interface patches
    solidPatch interface;
    fluidPatch interface;

    // Predictors at the start of a new time step; the fluid-side predictor
    // avoids the first-iterate added-mass spike of IQN-ILS
    predictor            yes;
    predictSolid         yes;

    // Under-relaxation of the first two iterations of each time step
    relaxationFactor 0.05;

    // Tolerance for the FSI loop within each time-step
    outerCorrTolerance 1e-4;

    // Maximum number of outer FSI loop correctors within each time-step
    nOuterCorr 30;

    // Enable/disable coupling from the start
    coupled yes;

    // The tetrahedral/hexahedral solid and the cfMesh fluid meshes do not
    // conform at the interface
    interfaceTransferMethod AMI;

    // Re-use the secant modes of the previous time steps
    couplingReuse 5;

    // Write fsi residuals to file
    writeResidualsToFile yes;
}

// ************************************************************************* //
