tutorials/fluidSolidInteraction/hessenthalerFsi/constant/solid/mechanicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.4                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      mechanicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

planeStress     no;

// RTV silicone rubber (13 Shore A): rho_s = 1058.3 kg/m^3 (Hessenthaler et
// al. 2017, Table 3). The shear modulus is calibrated to the Phase I
// zero-flow tip deflection of 29.50 mm (see README.md); K follows from the
// Poisson's ratio nu, K = 2*mu*(1 + nu)/(3*(1 - 2*nu)), nu = 0.49
mechanical
(
    silicone
    {
        type            neoHookeanElastic;
        rho             rho [1 -3 0 0 0 0 0] 1058.3;
        mu              mu [1 -1 -2 0 0 0 0] 61000;
        K               K [1 -1 -2 0 0 0 0] 3.02967e+06;
    }
);

// ************************************************************************* //
