tutorials/fluidSolidInteraction/hessenthalerFsi/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.4                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     solids4Foam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         10;

deltaT          0.002;

writeControl    adjustable;

writeInterval   1;

purgeWrite      0;

writeFormat     binary;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  no;

maxCo           5;

functions
{
    #include "gravityRamp"

    // Deflection of the centre of the flap tip
    flapTip
    {
        type            solidPointDisplacement;
        region          solid;
        point           (0 0 0.065);
    }

    // Displacement along the centreline x = y = 0 of the undeformed flap;
    // the deformed centreline is (0, D_y, z + D_z)
    flapCentreline
    {
        type            sets;
        libs            (sampling);
        region          solid;
        writeControl    writeTime;
        interpolationScheme cellPoint;
        setFormat       raw;
        fields          (D);
        sets
        {
            centreline
            {
                type    cloud;
                axis    xyz;
                points
                (
                (0 0 0)
                (0 0 0.0005)
                (0 0 0.001)
                (0 0 0.0015)
                (0 0 0.002)
                (0 0 0.0025)
                (0 0 0.003)
                (0 0 0.0035)
                (0 0 0.004)
                (0 0 0.0045)
                (0 0 0.005)
                (0 0 0.0055)
                (0 0 0.006)
                (0 0 0.0065)
                (0 0 0.007)
                (0 0 0.0075)
                (0 0 0.008)
                (0 0 0.0085)
                (0 0 0.009)
                (0 0 0.0095)
                (0 0 0.01)
                (0 0 0.0105)
                (0 0 0.011)
                (0 0 0.0115)
                (0 0 0.012)
                (0 0 0.0125)
                (0 0 0.013)
                (0 0 0.0135)
                (0 0 0.014)
                (0 0 0.0145)
                (0 0 0.015)
                (0 0 0.0155)
                (0 0 0.016)
                (0 0 0.0165)
                (0 0 0.017)
                (0 0 0.0175)
                (0 0 0.018)
                (0 0 0.0185)
                (0 0 0.019)
                (0 0 0.0195)
                (0 0 0.02)
                (0 0 0.0205)
                (0 0 0.021)
                (0 0 0.0215)
                (0 0 0.022)
                (0 0 0.0225)
                (0 0 0.023)
                (0 0 0.0235)
                (0 0 0.024)
                (0 0 0.0245)
                (0 0 0.025)
                (0 0 0.0255)
                (0 0 0.026)
                (0 0 0.0265)
                (0 0 0.027)
                (0 0 0.0275)
                (0 0 0.028)
                (0 0 0.0285)
                (0 0 0.029)
                (0 0 0.0295)
                (0 0 0.03)
                (0 0 0.0305)
                (0 0 0.031)
                (0 0 0.0315)
                (0 0 0.032)
                (0 0 0.0325)
                (0 0 0.033)
                (0 0 0.0335)
                (0 0 0.034)
                (0 0 0.0345)
                (0 0 0.035)
                (0 0 0.0355)
                (0 0 0.036)
                (0 0 0.0365)
                (0 0 0.037)
                (0 0 0.0375)
                (0 0 0.038)
                (0 0 0.0385)
                (0 0 0.039)
                (0 0 0.0395)
                (0 0 0.04)
                (0 0 0.0405)
                (0 0 0.041)
                (0 0 0.0415)
                (0 0 0.042)
                (0 0 0.0425)
                (0 0 0.043)
                (0 0 0.0435)
                (0 0 0.044)
                (0 0 0.0445)
                (0 0 0.045)
                (0 0 0.0455)
                (0 0 0.046)
                (0 0 0.0465)
                (0 0 0.047)
                (0 0 0.0475)
                (0 0 0.048)
                (0 0 0.0485)
                (0 0 0.049)
                (0 0 0.0495)
                (0 0 0.05)
                (0 0 0.0505)
                (0 0 0.051)
                (0 0 0.0515)
                (0 0 0.052)
                (0 0 0.0525)
                (0 0 0.053)
                (0 0 0.0535)
                (0 0 0.054)
                (0 0 0.0545)
                (0 0 0.055)
                (0 0 0.0555)
                (0 0 0.056)
                (0 0 0.0565)
                (0 0 0.057)
                (0 0 0.0575)
                (0 0 0.058)
                (0 0 0.0585)
                (0 0 0.059)
                (0 0 0.0595)
                (0 0 0.06)
                (0 0 0.0605)
                (0 0 0.061)
                (0 0 0.0615)
                (0 0 0.062)
                (0 0 0.0625)
                (0 0 0.063)
                (0 0 0.0635)
                (0 0 0.064)
                (0 0 0.0645)
                (0 0 0.065)
                );
            }
        }
    }
}

// ************************************************************************* //
