tutorials/fluidSolidInteraction/hessenthalerFsi/system/fluid/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.4                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default            backward;
}

gradSchemes
{
    default            Gauss linear;
    grad(U)            cellLimited Gauss linear 1;
}

divSchemes
{
    default            none;
    div(phi,U)         Gauss linearUpwind grad(U);
    div((nuEff*dev2(T(grad(U))))) Gauss linear;
    div((nuEff*dev(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default            Gauss linear limited corrected 0.5;
}

interpolationSchemes
{
    default            linear;
}

snGradSchemes
{
    default            limited corrected 0.5;
}

fluxRequired
{
    default            no;
    p;
}

wallDist
{
    method             meshWave;
}

// ************************************************************************* //
